# YOLOv11n-P2 Custom Model Configuration
# Adds P2 detection head for small object detection at long range
# Uses GhostConv/C3Ghost for lightweight deployment on edge devices

# Parameters
nc: 1  # number of classes (hen)
scales:
  n: [0.50, 0.25, 1024]  # nano model

# YOLOv11 backbone (with P2 output)
backbone:
  - [-1, 1, Conv, [64, 3, 2]]              # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]             # 1-P2/4
  - [-1, 3, C3k2, [128, True]]             # 2
  - [-1, 1, Conv, [256, 3, 2]]             # 3-P3/8
  - [-1, 6, C3k2, [256, True]]             # 4
  - [-1, 1, Conv, [512, 3, 2]]             # 5-P4/16
  - [-1, 6, C3k2, [512, True]]             # 6
  - [-1, 1, Conv, [1024, 3, 2]]            # 7-P5/32
  - [-1, 3, C3k2, [1024, True]]            # 8
  - [-1, 1, SPPF, [1024, 5]]               # 9
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 10
  - [[-1, 6], 1, Concat, [1]]              # 11 - P4 features
  - [-1, 3, C3k2, [512, False]]            # 12

  # P2 branch (for small objects)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 13
  - [[-1, 4], 1, Concat, [1]]              # 14 - P3 features
  - [-1, 3, C3k2, [256, False]]            # 15

  # P2 head (high resolution for small objects)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 16
  - [[-1, 2], 1, Concat, [1]]              # 17 - P2 features (128x128 grid)
  - [-1, 3, C3k2, [128, False]]            # 18

# YOLOv11 head with P2
head:
  - [[18, 15, 12, 9], 1, Detect, [nc]]  # P2, P3, P4, P5 Detect
